---
kind: property
id: P:Autodesk.Revit.DB.FilledRegionType.LineWeight
source: html/bf852993-cbe3-330f-e8d5-7a17c45c8ce8.htm
---
# Autodesk.Revit.DB.FilledRegionType.LineWeight Property

The line weight of the fill pattern.

## Syntax (C#)
```csharp
public int LineWeight { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: lineWeight is not a valid line weight value (it must be within the range of 1-16).